examples/delta-wing-hpc/input/case_template/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"
    minX // inlet
    {
        type            freestreamPressure;
        freestreamValue $internalField;
    }
    maxX // outlet
    {
        type            freestreamPressure;
        freestreamValue $internalField;
    }

    minY // right side
    {
        type            zeroGradient;
    }
    maxY // left side
    {
        type            zeroGradient;
    }
    minZ // bottom
    {
        type            zeroGradient;
    }
    maxZ // top
    {
        type            zeroGradient;
    }
    solid
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
